# 1.	Напишите программу, которая принимает на вход вещественное
# число и показывает сумму его цифр.

n = input("Введите число: ")




# 2.	Напишите программу, которая принимает на вход число N и выдает набор
# произведений чисел от 1 до N.

# n = int(input("Введите число: "))
# prod = 1
# for i in range (1, n + 1):
#     prod = prod * i
#     print(prod)


# 3. Задайте список из n чисел последовательности(1 + 1 / n) ^ n
# выведите на экран их сумму.


# 4.	Задайте числами список из N элементов, заполненных из промежутка [-N, N].
# Найдите произведение элементов на указанных позициях.
# Позиции хранятся в файле file.txt в одной строке одно число.


# 5.	Реализуйте алгоритм перемешивания списка
# (shuffle использовать нельзя, другие методы из библиотеки random - можно).